package lyapaside;

public class AllOurPatterns {
	
	private String[] string_patterns = {
			"^[a-zA-Z]\\w*[ ]*[(][\\w/, ]*[)]",                     // объявление функции
			"^@[ ]*\\+[ ]*[LFK][\\d ]+[(][\\w ]+[)]",               // создание комплекса
			"^[/][ ]*'[^']*'[ ]*>[ ]*C",                            // вывод строки
			"^[/][ ]*[LFK][\\d ]+[<>][ ]*C",                        // ввод/вывод комплекса
			"^[*][\\w ]+[(][\\w/, ]*[)]",                           // вызов функции
			"^[*]{2}",                                              // конец программы
			"^[$][ ]*\\d+",                                         // параграф
			"^[O∆∇⁻[ ]*([a-z]|[LFK]\\d+[ ]*([a-z]|[.][ ]*\\d+))",   // обнуление переменной/элемента комлекса
			"^→[ ]*\\d+",                                           // переход на параграф
			// TODO
	};
	
}
